Охотники_и_рыболовы/src/AccumulationRegisters/ВыдачаРазрешений/ВыдачаРазрешений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВыдачаРазрешений</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОхоты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>СезонОхоты</name>
    <type>
      <types>CatalogRef.СезоныОхоты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Охотхозяйство</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоОхоты</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДичи</name>
    <type>
      <types>CatalogRef.ВидыДичи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтчетныйВидДичи</name>
    <type>
      <types>CatalogRef.ОтчетныеВидыДичи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Охотники_и_рыболовы/src/InformationRegisters/КонтактнаяИнформация/КонтактнаяИнформация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтактнаяИнформация</name>
  <resources>
    <name>Город</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Улица</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Дом</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Квартира</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Охотник</name>
    <type>
      <types>CatalogRef.Охотники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Охотники_и_рыболовы/src/AccumulationRegisters/ОбщиеКвотыНаОхотхозяйство/ОбщиеКвотыНаОхотхозяйство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОбщиеКвотыНаОхотхозяйство</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СезонОхоты</name>
    <type>
      <types>CatalogRef.СезоныОхоты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Охотхозяйство</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДичи</name>
    <type>
      <types>CatalogRef.ВидыДичи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Охотники_и_рыболовы/src/CommonModules/ОхотаВызовСервера/Module.bsl
Функция ПолучитьАктуальностьПользователя() Экспорт
	Возврат ОхотаСервер.ПользовательАктуален();	
КонецФункции

Функция ЭтоПервыйЗапуск() Экспорт
		Возврат ПараметрыСеанса.ПервыйЗапуск;	
КонецФункции

Функция ПолучитьСписокНеСдавшихРазрешения() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ВыдачаРазрешенийОбороты.Регистратор.Охотник.Наименование, ""Неизвестный охотник"") КАК Охотник,
		|	ВыдачаРазрешенийОбороты.Регистратор.СерияРазрешения КАК Серия,
		|	ВыдачаРазрешенийОбороты.Регистратор.НомерРазрешения КАК Номер,
		|	ВыдачаРазрешенийОбороты.Регистратор.Представление КАК Документ,
		|	ЕСТЬNULL(ВыдачаРазрешенийОбороты.Регистратор.Охотник.НомерТелефона, """") КАК НомерТелефона,
		|	ЕСТЬNULL(КонтактнаяИнформация.Город, """") КАК Город,
		|	ЕСТЬNULL(КонтактнаяИнформация.Улица, """") КАК Улица,
		|	ЕСТЬNULL(КонтактнаяИнформация.Дом, """") КАК Дом,
		|	ЕСТЬNULL(КонтактнаяИнформация.Квартира, """") КАК Квартира
		|ИЗ
		|	РегистрНакопления.ВыдачаРазрешений.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, Охотхозяйство = &Охотхозяйство) КАК ВыдачаРазрешенийОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|		ПО ВыдачаРазрешенийОбороты.Регистратор.Охотник = КонтактнаяИнформация.Охотник
		|ГДЕ
		|	ВыдачаРазрешенийОбороты.Регистратор.Обработан
		|	И НЕ ВыдачаРазрешенийОбороты.Регистратор.Сдан
		|	И РАЗНОСТЬДАТ(ВыдачаРазрешенийОбороты.Регистратор.ДатаОкончания, &Сегодня, ДЕНЬ) > &ДнейОжиданияВозвратаРазрешения";
	
	Запрос.УстановитьПараметр("ДатаНачала", (ТекущаяДата() - 3*365*24*60*60));
	Запрос.УстановитьПараметр("ДатаОкончания", ТекущаяДата());
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос.УстановитьПараметр("ДнейОжиданияВозвратаРазрешения", Константы.ДнейОжиданияВозвратаРазрешения.Получить());
	УстановитьПривилегированныйРежим(Ложь);	
	
	
	Если РольДоступна("ПолныеПрава") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"Охотхозяйство = &Охотхозяйство","");
	Иначе	
		Охотхозяйство = ОхотаСерверПовтИсп.ПолучитьНастройкуПользователя(ПланыВидовХарактеристик.НастройкиПользователей.ОсновнаяОрганизация);
		Запрос.УстановитьПараметр("Охотхозяйство", Охотхозяйство);
	КонецЕсли;	
	Запрос.УстановитьПараметр("Сегодня", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Задолжники = Новый Массив;
	
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Задолжники;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Содержание = Новый Структура("Охотник,Серия,Номер,Документ,Город,Улица,Дом,Квартира,НомерТелефона");
		ЗаполнитьЗначенияСвойств(Содержание, Выборка);
		Задолжники.Добавить(Содержание);
	
	КонецЦикла;
	
	Возврат Задолжники;
		
КонецФункции

Функция ПолучитьГоловноеПредприятие() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	ГоловноеПредприятине = Константы.ГоловноеПредприятие.Получить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ГоловноеПредприятине;
КонецФункции

Функция ПолучитьВсеВидыДичи(СезонОхоты) Экспорт
	
	ВидыДичи = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбщиеКвотыОстатки.ВидДичи КАК ВидДичи
		|ИЗ
		|	РегистрНакопления.ОбщиеКвотыНаОхотхозяйство.Остатки(
		|			,
		|			СезонОхоты = &СезонОхоты
		|				И Охотхозяйство = &Охотхозяйство) КАК ОбщиеКвотыОстатки";
		
	ГоловноеПредприятие = ПолучитьГоловноеПредприятие();
	
	Если ГоловноеПредприятие.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не установлено головное предприятие");
		Возврат ВидыДичи;
	КонецЕсли;	
		
	Запрос.УстановитьПараметр("Охотхозяйство", ГоловноеПредприятие);
	Запрос.УстановитьПараметр("СезонОхоты", СезонОхоты);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат ВидыДичи;
	Иначе
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ВидыДичи.Добавить(Выборка.ВидДичи);		
		КонецЦикла;	
		Возврат ВидыДичи;	
	КонецЕсли;
КонецФункции


Функция ПолучитьОбязательныеРеквизитыРазрешения() Экспорт
	Возврат Константы.ОбязательныеРеквизитыРазрешенияДляЕгеря.Получить().Получить();	
КонецФункции
